In [ ]:
#pip install pyodbc

In [1]:
import pyodbc
import pandas as pd

In [ ]:
# Database connection parameters
server = 'PT-L163255\SQLEXPRESS01'  # e.g., 'localhost' or 'server_name'
database = 'University'  # e.g., 'my_database'

# Connection string
conn_str = (
    f"DRIVER={{ODBC Driver 17 for SQL Server}};"
    f"SERVER={server};"
    f"DATABASE={database};"
    f'Trusted_Connection=yes;'
)

# Connect to the SQL Server database
conn = pyodbc.connect(conn_str)

# Execute a query and load data into a DataFrame
#query = "SELECT * FROM aluno"  # Replace 'your_table' with your actual table name
#df = pd.read_sql_query(query, conn)

query = f"SELECT * FROM aluno"
cursor = conn.cursor()
cursor.execute(query)
results = [list(row) for row in cursor.fetchall()]
colunas = ['nr_aluno', 'nome', 'apelido', 'curso', 'media_entrada', 'curso_concluido', 'media_final']
df = pd.DataFrame(results, columns= colunas )

In [2]:
df = pd.read_csv('/workspaces/Data_Engineering/output_dataengineering.csv')
df

,0,nr_aluno,nome,apelido,curso,media_entrada,curso_concluido,media_final
0,0,20031358,Leonardo,Pires,Psicologia,15,True,16.0
1,1,2022158,Raquel,Laranjeira,Informática,17,True,11.0
2,2,2003812,Anne,Silva,Informática,16,True,16.0
3,3,2022901,Patrícia,Castelo-Branco,Informática,11,True,17.0
4,4,2019303,Avelino,Sampaio,Comunicação,13,True,18.0
...,...,...,...,...,...,...,...,...
1755,1755,2019869,Alice,Laranjeira,Informática,11,True,17.0
1756,1756,20221093,Patrícia,Pereira,Comunicação,14,True,16.0
1757,1757,20071160,Lucas,Capicua,Informática,12,True,20.0
1758,1758,2020288,Pedro,Capicua,Comunicação,13,True,19.0
1759,1759,2019163820,Diana,da Silva,Comunicação,13,True,18.0

### Check Duplicados

In [3]:
#Não há duplicados
duplicados = df['nr_aluno'].duplicated()
duplicados.sum()

np.int64(0)

### Collect all 'Apelido' that contains '()'

In [4]:
#Apelido retirar os parenteses
#df['apelido'] = df['apelido'].str.replace(r'[()]', '', regex=True)
df_apelido = df[df['apelido'].str.contains(r'\(.*\)')]
df_apelido

,0,nr_aluno,nome,apelido,curso,media_entrada,curso_concluido,media_final
100,100,2210000,Thomas Anderson,(Neo),Informática,20,True,20.0
201,201,2290110,Anakin Skywalker,(Lord Vader),Psicologia,20,True,20.0
804,804,2210030,Sininho,(Terra do Nunca),Cintilar,-20,True,-20.0

### Select that are not in the list [['Psicologia', 'Informática', 'Comunicação']]

In [5]:
cursos = ['Psicologia', 'Informática', 'Comunicação']
df.loc[~df['curso'].isin(cursos)] = 'NULL'

#df.curso.isnull()
df_nulls_ = df[df['curso'] == 'NULL']
df_nulls_

/tmp/ipykernel_39074/3003480293.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'NULL' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[~df['curso'].isin(cursos)] = 'NULL'
/tmp/ipykernel_39074/3003480293.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'NULL' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[~df['curso'].isin(cursos)] = 'NULL'
/tmp/ipykernel_39074/3003480293.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'NULL' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[~df['curso'].isin(cursos)] = 'NULL'
/tmp/ipykernel_39074/3003480293.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'NULL' has dtype incompatible with bool, please explicitly cast to a compatible dtype first.
  df.loc[~df['curso'].isin(cursos)] = 'NULL'
/tmp/ipykernel_39074/3003480293.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'NULL' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.loc[~df['curso'].isin(cursos)] = 'NULL'

,0,nr_aluno,nome,apelido,curso,media_entrada,curso_concluido,media_final
26,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
28,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
31,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
35,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
36,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
37,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
41,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
43,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
44,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
51,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
403,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
804,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL

In [15]:
filtered_df = df[df['curso'] == 'NULL']
curso_null_values = filtered_df['curso']
curso_null_values

26     NULL
28     NULL
31     NULL
35     NULL
36     NULL
37     NULL
41     NULL
43     NULL
44     NULL
51     NULL
403    NULL
804    NULL
Name: curso, dtype: object

In [17]:
df['nr_aluno'].iloc[26]

'NULL'

In [ ]:
#Confirmar curso 

cursos = ['Psicologia', 'Informática', 'Comunicação']
df.loc[~df['curso'].isin(cursos)] = 'NULL'



for i in df['curso']:
    if i not in ['Psicologia', 'Informática', 'Comunicação']:
          print(i)

In [ ]:
#convert str to int 'media_entrada' e 'media_final
#df['media_entrada'] = df['media_entrada'].astype(int)
#df = df[df['media_entrada'] > 0]
'''
for i in df['media_entrada']:
    if i != 'NULL':
        if int(i) < 0:
            print(i)
'''
#print(df['media_entrada'].isnull())

print(df)

In [ ]:
#df['curso'] = df['curso'].str.replace(r'', 'NULL', regex=True)

#print(duplicados)


# Write DataFrame to a CSV file
#df.to_csv('output_db.csv', index=False)

# Close the database connection
conn.close()